SilentBob347/espkvm/sdkconfig.defaults
# The chip. A fresh clone picks this up, so `idf.py build` targets the P4 on its
# own - without it idf.py defaults to esp32 and fails with an "xtensa-esp32-elf-gcc
# not found" toolchain error (the P4 is RISC-V). An existing build/ keeps its own
# target; run `idf.py set-target esp32p4` to switch a tree already configured.
CONFIG_IDF_TARGET="esp32p4"

# This board carries an ESP32-P4 rev v1.3. IDF 6.x defaults to v3.1+, and rev <3.0
# and >=3.0 are mutually exclusive targets, so the <3.0 family must be selected
# explicitly or the bootloader refuses to run.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Waveshare ESP32-P4-ETH carries 32 MB; the default 2 MB leaves no room for OTA.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# Two app slots so a bad update can be rolled back - see partitions_32mb.csv.
# The app/OTA slots are identical to the 16 MB table (partitions_16mb.csv); only
# the tail data partitions differ, so the same firmware image fits either.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_32mb.csv"

# Roll back automatically if a freshly flashed image never reports itself
# healthy: on a KVM, an update that cannot reach the network has also removed
# the way to fix it.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Keep a core dump when the firmware panics.
#
# Nobody has a serial cable on the machine this is attached to, so a crash
# reported from the field arrives as "it rebooted" and nothing else. Two of them
# are open right now with no evidence at all. The dump goes into the 56 KB
# partition that sits in free space below the first app slot, survives the
# reboot, and the console hands it over as a file.
#
# The whole .bss and the heap are deliberately left out (the default): what is
# wanted is the registers and the stacks, and 56 KB has to hold them.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=32

# Full-frame capture @ 1080p needs PSRAM (ping-pong buffers + JPEG + HTTP copy).
# esp_http_server: max_open_sockets + 3 internal fds must be <= CONFIG_LWIP_MAX_SOCKETS.
# Headroom for concurrent /stream + /video + /ws (and a dev proxy opening several TCPs).
CONFIG_LWIP_MAX_SOCKETS=24

CONFIG_KVM_JPEG_QUALITY=70

# WebSocket /ws for browser -> USB HID control plane
CONFIG_HTTPD_WS_SUPPORT=y
# Default 1024 is too small for Chromium + Vite proxy (sec-ch-ua-*, cookies) -> 431 on device.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=8192

# Composite HID keyboard + mouse (TinyUSB)
# Two HID interfaces: a boot-protocol keyboard for firmware screens, and a
# pointer interface carrying absolute, relative and consumer reports.
CONFIG_TINYUSB_HID_COUNT=3

# ESP32-P4 AP-HEX PSRAM size (e.g. 32 MB) is detected at boot - no separate "32MB" Kconfig.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Small allocations go to PSRAM too. IDF's default sends everything up to 16 KB
# to internal RAM first, and that is exactly the size of a TLS record buffer -
# so every connection the browser opens carves 20 KB out of internal RAM and
# hands it back later, leaving holes. The H.264 encoder needs 155 KB of internal
# RAM in ONE piece, and a device with 314 KB free but no run longer than 132 KB
# could not rebuild it. Anything that needs DMA-capable memory asks for
# MALLOC_CAP_DMA explicitly, so it is unaffected by this threshold.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Optimise for speed. The default is -Og, which left the capture and encode
# path, the frame conversions and TLS all compiled for a debugger.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# A hung task is a black screen until someone pulls the plug. With the watchdog
# set to panic, it is a reboot with a core dump instead (the dump goes to flash).
# Ten seconds because a codec switch may wait five for a slow viewer to let go.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# The device generates its own certificate on first boot: a KVM ships without
# anyone to issue it one, and asking the operator for a PEM before the web
# interface works at all is not a usable first run.
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_X509_CRT_WRITE_C=y

# No dynamic TLS buffers. They freed a session's output buffer at the end of
# every write, and the video pump and the server write to the same WebSocket
# from two tasks: one write copied into the buffer the other had just freed, and
# the device panicked. They were there to spare internal RAM, but TLS buffers
# come from PSRAM now (below), so all they saved was ~20 KB of PSRAM a socket.
# CONFIG_MBEDTLS_DYNAMIC_BUFFER is not set

# TLS buffers and contexts come from PSRAM. Internal RAM is ~500 KB and has
# ~70 KB free once WiFi and Tailscale run; a large HTTPS upload then failed to
# get a 4 KB TLS buffer and took the WiFi link down with it.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# microlink (native Tailscale) calls raw lwIP APIs (udp_*, netif_*, wireguardif_*)
# from its own tasks. Under the default tcpip-thread model that races the TCP/IP
# thread and corrupts lwIP (crash in tcp_output once the console serves TLS).
# Core locking lets those calls be made safely from any task by taking the core
# lock (microlink wraps them via ml_lwip_lock.h). BSD-socket users are unaffected.
CONFIG_LWIP_TCPIP_CORE_LOCKING=y

# MJPEG pushes large JPEG segments; lwIP defaults (~5.8 KiB) cause backpressure/resets on Ethernet.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
# The receive queue must hold a whole window (65535 / 1440 + 2). At the default 6
# a burst overflows it, lwIP drops the rest until its next timer (125 ms), and
# every upload is stuck at ~64 KB/s per connection whatever the link.
CONFIG_LWIP_TCP_RECVMBOX_SIZE=48
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=6144

# Resumption: a full handshake costs this chip ~330 ms and the console opens
# several connections at once.
CONFIG_ESP_TLS_SERVER_SESSION_TICKETS=y

# The websocket handler is not called for the upgrade (esp_http_server returns
# right after the handshake), so the session cookie can only be checked here.
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y

# microlink (native Tailscale) brings up its WireGuard data plane with a raw lwIP
# netif_add, which stores its own device in netif->state. By default esp_netif
# also keeps its handle in netif->state, and its global lwIP ext-callback then
# reads the WireGuard pointer as an esp_netif_t and crashes (esp_netif_internal_
# dhcpc_cb, a Load access fault) the instant the tunnel netif is added. Enabling a
# "special" lwIP interface flips LWIP_ESP_NETIF_DATA on, moving esp_netif's handle
# into netif->client_data so it no longer aliases netif->state; the WireGuard
# netif's client_data is zero, so the callback sees NULL and bails. We do not
# create a bridge - this is only here for that side effect.
CONFIG_ESP_NETIF_BRIDGE_EN=y

# IPv6. lwIP compiles it in by default but only ever gets a link-local address
# without SLAAC, which is useless from another subnet. With autoconfiguration on,
# the device picks up a routable address from the router's advertisements and the
# console answers on it (esp_http_server already binds a dual-stack socket).
# RDNSS carries the resolvers in the same advertisement, so DNS keeps working on
# a link that only offers them over v6. Addressing is still dual-stack: IPv4 is
# how the tunnels and Wake-on-LAN reach out.
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_RDNSS_MAX_DNS_SERVERS=2

# Native Tailscale (microlink) wraps its Noise layer in ChaCha20-Poly1305 via the
# PSA API. On WiFi SoCs the supplicant pulls these primitives in transitively; the
# P4 has no WiFi radio, so enable them explicitly or PSA_ALG_CHACHA20_POLY1305 is
# unsupported at runtime and the Tailscale handshake fails.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y

# See both sides of a target going to sleep: the bus falling quiet and coming
# back are the first two questions when a keyboard dies after a wake.
CONFIG_TINYUSB_SUSPEND_CALLBACK=y
CONFIG_TINYUSB_RESUME_CALLBACK=y

# exFAT needs the volume-label API (ff.c uses it outside a preprocessor test).
CONFIG_FATFS_USE_LABEL=y
